ModifySubscriber.xml

<soapenv:Envelope xmlns:ccws="http://comverse-in.com/prepaid/ccws" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-19860713" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>${username}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            <wsse:Nonce>rinSlv8BImrKQIwMxzGATg==</wsse:Nonce>
            <wsu:Created>${created}</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ccws:VersionInfoHeader></ccws:VersionInfoHeader>
      <ccws:SourceInfo></ccws:SourceInfo>
      <ccws:MTRDataArray></ccws:MTRDataArray>
   </soapenv:Header>
   <soapenv:Body>
      <ccws:ModifySubscriber>
         <!--Optional:-->
         <ccws:subscriber>
            <!--Optional:-->
            <ccws:SubscriberID>${suscriberID}</ccws:SubscriberID>
            <ccws:DeleteSubscriberPeriodicCharges>false</ccws:DeleteSubscriberPeriodicCharges>
            <!--Optional:-->
            <ccws:Subscriber>
               <!--Optional:-->
               <ccws:CurrentState>${state}</ccws:CurrentState>
            </ccws:Subscriber>
         </ccws:subscriber>
      </ccws:ModifySubscriber>
   </soapenv:Body>
</soapenv:Envelope>